gett/gett_ui/lib/cerberus/create_directory.xml.erb

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:cer="http://cerberusllc.com/service/cerberusftpservice" xmlns:com="http://cerberusllc.com/common">
   <soap:Header/>
   <soap:Body>
      <cer:CreateDirectoryRequest>
         <com:credentials>
            <com:user><%= soap_username %></com:user>
            <com:password><%= soap_password %></com:password>
         </com:credentials>
         <cer:directoryPath>D:/ftproot/<%= directory %></cer:directoryPath>
      </cer:CreateDirectoryRequest>
   </soap:Body>
</soap:Envelope>
